cask_args appdir: '/Applications'

### EXTRA CLI UTILITIES
brew "axel"                                 # Fast CLI downloader 
brew "djvu2pdf"                             # Converts djvu files to pdf
brew "dos2unix"                             # Translate newlines between DOS and UNIX
brew "cksfv"                                # Utility to check SFV files
brew "cloc"                                 # Count lines of code
brew "cmus"                                 # Terminal music player
brew "colordiff"                            # Colored diff
brew "expect"                               # To write scripts that expect interaction
brew "ext4fuse"                             # To mount Linux drives
brew "fonttools"                            # Tools to manage fonts
brew "geckodriver"                          # Firefox webdriver
brew "hugo"                                 # Golang static content generator
brew "hub"                                  # Perform GitHub actions from the CLI
brew "jrnl"                                 # Journaling app from the CLI 
brew "magic-wormhole"                       # CLI tool to share files securely
brew "mutt", args: ['with-trash-patch']     # Email Client
brew "nethogs"                              # Network analyzer
brew "pass"                                 # UNIX password manager based on gpg
brew "shellcheck"                           # Bash/sh Linter
brew "speedtest_cli"                        # Speedtest on CLI
brew "stress"                               # Creates several types of compute stress
brew "switchaudio-osx"                      # Switch audio input/output
brew "tldr"                                 # Simpler man pages

#### NON CORE CASKS ####
cask "adobe-acrobat-reader"                 # To fill forms only compatible with Adobe Acrobat
cask "coconutbattery"                       # Displays battery health
cask "cscreen"                              # Check Display properties from CLI
cask "docker"                               # Containerization tool
cask "gfxcardstatus"                        # Changes the dedicated and internal graphics
cask "iina"                                 # Video player with nicer configs than VLC
cask "xquartz"                              # DEP: Inkscape dependency
cask "inkscape"                             # Vector graphics
cask "keycastr"                             # Keystroke visualizer
#cask "kodi"                                 # Media center for music, tvshows and movies
cask "macdown"                              # Simple markdown editor with live preview
cask "meld"                                 # Diff/Merge tool
cask "monitorcontrol"                       # Uses DDC/CI to setup monitor brightness/contrast
#cask "obs"                                  # Screen recording/streaming software
cask "openemu"                              # Emulator collection
#cask "pock"                                 # Dock in touchbar
#cask "postman"                              # Debugger for GET/POST requests
#cask "rescuetime"                           # Time tracking & productivity
#cask "sequel-pro"                           # SQL frontend
cask "skype"                                # Video calls
cask "sourcetree"                           # Git visualization tool
cask "sublime-merge"                        # Sublime merge tool
#cask "virtualbox"                           # Virtual machines
#cask "vagrant"                              # Automated VM management/deployment
cask "xld"                                  # Convert flac files

### Mac App Store Installs
mas "Mathpix Snipping Tool", id: 1349670778         # Capture LaTeX formulas


### PROGRAMMING LANGUAGES
# Note ruby and python are already on main Brewfile

# C C++
brew "gcc", args: ['with-all-languages']   # Get GCC compiler (macOS default is clang)

# Java and Scala (order matters)
cask "java"
brew "ant"
brew "scala"
# brew "sbt"

# Node.js
brew "node"
brew "npm"
brew "nvm"
brew "yarn"

# Haskell
brew "ghc"
brew "cabal-install"

# Go, Julia, R
brew "golang"
cask "julia"
# brew "r", args: ['with-openblas']
cask "R"
cask "rstudio"
brew "lua"

# Docker
#brew "docker"                               # Docker Containers
#brew "docker-compose"
#brew "docker-swarm"

### EXTRA NICETIES


## MPV

### INSTALL MPV  with 60 fps###
# https://www.reddit.com/r/osx/comments/4ljbdq/mpv_tutorial_and_60_fps_playback_on_os_x/
brew "libass", args: ['without-harfbuzz']
brew "ffmpeg", args: ['with-rtmpdump', 'with-openssl', 'with-libass', 'with-libbs2b', 'with-rubberband']
# brew "mpv", args: ['with-vapoursynth', 'with-libarchive', 'with-bundle', 'with-bluray-support', 'with-libdvdread', 'with-little-cms2', 'with-lua']
cask "mpv"
brew "mvtools"
brew "ffms2"
brew "subliminal"

# AUTODL
brew "mono"
